// 给定若干张面值为7、3、2元的纸币，求若干张由这几种纸币的面值总和加起来等于100有多少种可能性？
function rmb100() {
  let count = 0
  // 遍历7元纸币从0到最大能出现的张数
  for (let i = 0; i <= 100 / 7; i++) {
    // 在7元纸币的张数确定之后，100 - i * 7则是剩余金额的数量，再遍历3元纸币从0到最大能出现的张数。这种比起计算3元的张数从0循环到100/3，减少了循环的次数
    for (let j = 0; j <= (100 - i * 7) / 3; j++) {
      // 由于7、3元的张数已经确定，这时只需要计算剩余的金额是否能被2整除即可。比起再从0循环到剩余金额/2，减少了一层for循环
      if (100 - i * 7 - j * 3 >= 0 && (100 - i * 7 - j * 3) % 2 == 0) {
        count += 1
      }
    }
  }
  console.log('basic total count=' + count)
}
rmb100()
